In [2]:
import pandas as pd
import sqlite3
import sqlalchemy

In [3]:
# Dang! I should check out the sqlite3 driver more!
query = """
CREATE TABLE test_table
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [4]:
connection = sqlite3.connect('exampledb.sqlite')

In [5]:
connection.execute(query)

In [6]:
connection.commit()

In [7]:
# throw in some data
data = [('Atl', 'Georg', 2, 6),
        ('Tal', 'Fl', 2.3, 7),
        ('Sac', 'CA', 6.7, 2)]

In [10]:
statement = "INSERT INTO test_table VALUES(?, ?, ?, ?)"

In [11]:
connection.executemany(statement, data)

In [12]:
connection.commit()

In [17]:
# Ok yank it back out
cursor = connection.execute('SELECT * FROM test_table')

In [18]:
rows = cursor.fetchall()

[('Atl', 'Georg', 2.0, 6), ('Tal', 'Fl', 2.3, 7), ('Sac', 'CA', 6.7, 2)]

In [19]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [20]:
# Ok can pull this into a data frame
columns = [x[0] for x in cursor.description]
columns

['a', 'b', 'c', 'd']

In [21]:
df1 = pd.DataFrame(rows, columns=columns)
df1

     a      b    c  d
0  Atl  Georg  2.0  6
1  Tal     Fl  2.3  7
2  Sac     CA  6.7  2

In [23]:
# Holy moley sql alchemy is rad. Abstracts this chore nicely
database = sqlalchemy.create_engine('sqlite:///exampledb.sqlite')

In [26]:
pd.read_sql('select * from test_table', database)

connection.close()

     a      b    c  d
0  Atl  Georg  2.0  6
1  Tal     Fl  2.3  7
2  Sac     CA  6.7  2